application/app/controllers/cidades_controller.rb

  def index
    @cidades = Cidade.all
---
SELECT "cidades".* FROM "cidades"

  def create
    @cidade = Cidade.new(cidade_params)

    respond_to do |format|
      if @cidade.save
---
INSERT INTO "cidades" ("created_at", "estado_id", "nome_cidade", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 17 Sep 2013 19:55:41 UTC +00:00], ["estado_id", 1], ["nome_cidade", "Pau dos Ferros"], ["updated_at", Tue, 17 Sep 2013 19:55:41 UTC +00:00]]

    def set_cidade
      @cidade = Cidade.find(params[:id])
---
SELECT "cidades".* FROM "cidades" WHERE "cidades"."id" = $1 LIMIT 1  [["id", "1"]]