application/app/controllers/estados_controller.rb

  def index
    @estados = Estado.all
---
SELECT "estados".* FROM "estados"