application/app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("codigo", "created_at", "nivel", "nome", "senha", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["codigo", "01"], ["created_at", Tue, 17 Sep 2013 19:30:42 UTC +00:00], ["nivel", 1], ["nome", "Cristiano"], ["senha", "samsung0503"], ["updated_at", Tue, 17 Sep 2013 19:30:42 UTC +00:00]]

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT 1  [["id", "1"]]